In [4]:
%load_ext sql

In [5]:
%sql sqlite:///first-database-sql.db

# 1. Almanya'dan verilen siparislerin kategorilerine gore ortalama fiyatlari?

In [4]:
%%sql
SELECT ca.CategoryName, AVG(p.Price) 
FROM Orders o 
LEFT JOIN OrderDetails od ON o.OrderID = od.OrderID 
LEFT JOIN Products p ON od.ProductID = p.ProductID 
LEFT JOIN Categories ca ON p.CategoryID = ca.CategoryID 
LEFT JOIN Customers cu ON o.CustomerID = cu.CustomerID 
WHERE cu.Country = 'Germany' GROUP BY CategoryName LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[('Beverages', 20.5),
 ('Condiments', 34.0),
 ('Confections', 40.0),
 ('Dairy Products', 151.64705882352942),
 ('Federal Shipping', 40.0)]

# 2.Almanya ya da USA'dan verilen siparislerin kategorilerine gore ortalma fiyatlari?

In [6]:
%%sql
SELECT ca.CategoryName, AVG(p.Price) 
FROM Orders o 
LEFT JOIN OrderDetails od ON o.OrderID = od.OrderID 
LEFT JOIN Products p ON od.ProductID = p.ProductID 
LEFT JOIN Categories ca ON p.CategoryID = ca.CategoryID 
LEFT JOIN Customers cu ON o.CustomerID = cu.CustomerID 
WHERE cu.Country = 'Germany' OR cu.Country = 'USA' GROUP BY CategoryName LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[('Beverages', 29.88888888888889),
 ('Condiments', 34.72727272727273),
 ('Confections', 39.92307692307692),
 ('Dairy Products', 131.75862068965517),
 ('Federal Shipping', 39.92307692307692)]

# 3. Haziran Temmuz Ağustos aylarinda verilen siparislerin ortalama fiyatlari?

In [7]:
%%sql
SELECT AVG(Products.Price) 
FROM Products 
LEFT JOIN OrderDetails ON OrderDetails.ProductID = products.ProductID 
LEFT JOIN Orders ON OrderDetails.OrderID = Orders.OrderID 
WHERE OrderDate like '%07%' OR OrderDate like '%08%' OR OrderDate like '%09%';

 * sqlite:///first-database-sql.db
Done.

[(39.71891891891892,)]

# 4. Musterilerin 1997 yılına ait siparislerinin maximum miktarlarını bulup, musterilerin isimleri ile birlikte buyukten kucuge siralayiniz.

In [10]:
%%sql
SELECT CustomerName, MAX(Price) maks 
FROM Products 
LEFT JOIN OrderDetails ON Products.ProductID = OrderDetails.ProductID 
LEFT JOIN Orders ON OrderDetails.OrderID = Orders.OrderID 
LEFT JOIN Customers ON Customers.CustomerID = Orders.CustomerID 
WHERE OrderDate like '%1997%' 
GROUP BY CustomerName ORDER BY maks DESC LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[('Gourmet Lanchonetes', 435),
 ('Simons bistro', 263),
 ('Mère Paillarde', 263),
 ('Save-a-lot Markets', 123),
 ('Eastern Connection', 123)]

# 5. Siparis yili 1997 olan siparisleri alan calisanlari siparis alma sayilarina gore sirala.

In [11]:
%%sql
SELECT COUNT(*) n, em.FirstName 
FROM Orders 
LEFT JOIN Employees em ON Orders.EmployeeID = em.EmployeeID 
WHERE OrderDate like '%1997%' 
GROUP BY em.FirstName 
ORDER BY n DESC LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[(26, 'Janet'), (18, 'Margaret'), (16, 'Laura'), (8, 'Andrew'), (6, 'Robert')]